# Core Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"

# Third Party Taps
tap "dart-lang/dart"
tap "kendfinger/personal"
tap "kendfinger/tools"

# Bundle Tools
brew "mas"

# Casks
cask "adoptopenjdk"
cask "alacritty"
cask "authy"
cask "firefox"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-nerd-font"
cask "font-source-code-pro"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "jetbrains-toolbox"
cask "microsoft-edge"
cask "microsoft-teams"
cask "multimc"
cask "osxfuse"
cask "signal"
cask "slack"
cask "telegram"
cask "transmission"
cask "visual-studio-code"
cask "vlc"

# Mac App Store
mas "AdGuard for Safari", id: 1440147259
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
# mas "Xcode", id:

# Core Tools
brew "coreutils"
brew "curl"
brew "dos2unix"
brew "file"
brew "findutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "grep"
brew "man-db"
brew "unzip"
brew "wget"
brew "zip"

# Containers
brew "ctop"
brew "docker"
brew "docker-machine"
brew "hyperkit"

# Kubernetes
brew "helm"
brew "kubernetes-cli"
brew "kustomize"
brew "minikube"
brew "stern"

# Native Development Tools
brew "binutils"
brew "ccache"
brew "clang-format"
brew "crosstool-ng"
brew "gcc"
brew "gdb"
brew "llvm"
brew "sccache"

# Editors
brew "nano"
brew "ox"
brew "vim"

# Build Systems
brew "autoconf"
brew "automake"
brew "bazel"
brew "bsdmake"
brew "cmake"
brew "doxygen"
brew "gradle"
brew "make"
brew "maven"
brew "meson"
brew "ninja"

# Version Control
brew "diff-so-fancy"
brew "git"
brew "git-lfs"
brew "mercurial"
brew "subversion"

# Shells
brew "bash"
brew "bash-completion"
brew "dash"
brew "elvish"
brew "fish"
brew "oil"
brew "zsh"
brew "zsh-completions"

# Apple Development
brew "carthage"
brew "cocoapods"
brew "swiftformat"
brew "swiftlint"

# Shell Utilities
brew "ack"
brew "ag"
brew "bat"
brew "exa"
brew "fd"
brew "httpie"
brew "jq"
brew "lsd"
brew "pv"
brew "ripgrep"
brew "pygments"
brew "watch"

# Terminal UI
brew "archey"
brew "fzf"
brew "htop"
brew "ncdu"
brew "sk"

# Languages
brew "dart"
brew "go"
brew "lua"
brew "node"
brew "openjdk"
brew "perl"
brew "ruby"
brew "rustup-init"

# Compression Utilities
brew "brotli"
brew "bzip2"
brew "gzip"
brew "libarchive"
brew "p7zip"
brew "xz"

# macOS Utilities
brew "blueutil"
brew "dark-mode"
brew "pinentry-mac"

# Media Tools
brew "exiftool"
brew "ffmpeg"
brew "mpv"
brew "youtube-dl"

# Network Tools
brew "iperf"
brew "iperf3"
brew "lftp"
brew "netcat"
brew "nmap"
brew "openssh"
brew "rsync"
brew "telnet"

# Service Tools
brew "awscli"
brew "doctl"
brew "gh"
brew "lastpass-cli"

# Environment Tools
brew "jenv"
brew "pyenv"

# Package Management
brew "pacapt"

# Code Tools
brew "cloc"
brew "sloc"
brew "terraform"
brew "watchman"
brew "xdot"

# Databases
brew "postgresql"
brew "sqlite"

# Backup Utilities
brew "duplicity"
brew "duply"

# Virtualization
brew "qemu"
brew "virtual"
